; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	thermograph3 - mode
	infrared2 - mode
	infrared1 - mode
	thermograph0 - mode
	image4 - mode
	Star4 - direction
	Star5 - direction
	Star0 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation3 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 thermograph0)
	(supports instrument2 image4)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared2)
	(supports instrument3 image4)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument7 thermograph3)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 Star7)
	(pointing satellite3 Phenomenon13)
	(have_image Planet6 infrared1)
	(have_image Star7 infrared1)
	(have_image Planet8 thermograph3)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 infrared1)
	(have_image Phenomenon11 thermograph0)
	(have_image Phenomenon12 thermograph3)
	(have_image Phenomenon13 thermograph3)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 11
2. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 0 of 11
3. (turn_to satellite2 phenomenon9 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 11
4. (take_image satellite2 phenomenon9 instrument5 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 1 of 11
5. (turn_to satellite2 phenomenon13 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 11
6. (take_image satellite2 phenomenon13 instrument5 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 2 of 11
7. (turn_to satellite2 phenomenon12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 11
8. (take_image satellite2 phenomenon12 instrument5 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 3 of 11
9. (turn_to satellite2 phenomenon11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 11
10. (turn_to satellite1 star7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star7)
   goals met: 4 of 11
11. (turn_to satellite0 star1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star1)
   goals met: 5 of 11
12. (take_image satellite2 phenomenon11 instrument5 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 6 of 11
13. (turn_to satellite2 planet10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet10)
   goals met: 6 of 11
14. (take_image satellite2 planet10 instrument5 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 7 of 11
15. (turn_to satellite2 planet6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet6)
   goals met: 7 of 11
16. (take_image satellite2 planet6 instrument5 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 8 of 11
17. (turn_to satellite2 planet8 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet8)
   goals met: 8 of 11
18. (take_image satellite2 planet8 instrument5 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 9 of 11
19. (turn_to satellite2 star7 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star7)
   goals met: 9 of 11
20. (take_image satellite2 star7 instrument5 infrared1)
   added: (have_image star7 infrared1)
   goals met: 10 of 11
21. (turn_to satellite3 phenomenon13 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 phenomenon13)
   goals met: 11 of 11
